In [1]:
#資料整理(遺失的資料)
import numpy as np
import pandas as pd

#np.nan
string_data = pd.Series(['板橋區', '中和區', np.nan, '土城區'])
string_data

0    板橋區
1    中和區
2    NaN
3    土城區
dtype: object

In [2]:
string_data[0] = np.nan
string_data

0    NaN
1    中和區
2    NaN
3    土城區
dtype: object

In [3]:
#isnull()
#notnull()
#fillna()
#dropna()

string_data.dropna()

1    中和區
3    土城區
dtype: object

In [10]:
#dataFrame的cleaning
from numpy import nan as NA
data = pd.DataFrame([[1., 6.5, 3.],
                    [1., NA, NA],
                    [NA, NA, NA],
                    [NA, 6.5, 3.]])
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [12]:
data
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -1.122384       NaN       NaN
1  0.976645       NaN       NaN
2  1.295233       NaN -0.509968
3  0.386441       NaN  0.165978
4 -1.247247 -1.945911  0.667475
5 -1.853678 -0.146326 -1.450416
6  0.068097  0.670591  1.448901

In [15]:
df.dropna()

          0         1         2
4 -1.247247 -1.945911  0.667475
5 -1.853678 -0.146326 -1.450416
6  0.068097  0.670591  1.448901

In [17]:
df.dropna(thresh=2)

          0         1         2
2  1.295233       NaN -0.509968
3  0.386441       NaN  0.165978
4 -1.247247 -1.945911  0.667475
5 -1.853678 -0.146326 -1.450416
6  0.068097  0.670591  1.448901

In [19]:
df.fillna(0)

          0         1         2
0 -1.122384  0.000000  0.000000
1  0.976645  0.000000  0.000000
2  1.295233  0.000000 -0.509968
3  0.386441  0.000000  0.165978
4 -1.247247 -1.945911  0.667475
5 -1.853678 -0.146326 -1.450416
6  0.068097  0.670591  1.448901

In [21]:
df.fillna({1:0,2:0.5})

          0         1         2
0 -1.122384  0.000000  0.500000
1  0.976645  0.000000  0.500000
2  1.295233  0.000000 -0.509968
3  0.386441  0.000000  0.165978
4 -1.247247 -1.945911  0.667475
5 -1.853678 -0.146326 -1.450416
6  0.068097  0.670591  1.448901

In [26]:
df[df.loc[:,1].notnull()]

          0         1         2
4 -1.247247 -1.945911  0.667475
5 -1.853678 -0.146326 -1.450416
6  0.068097  0.670591  1.448901

In [27]:
#replace()
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [28]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [29]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64